## Numpy

### Задание 1

Импортируйте библиотеку Numpy и дайте ей псевдоним np.
Создайте массив Numpy под названием a размером 5x2, то есть состоящий из 5 строк и 2 столбцов. Первый столбец должен содержать числа 1, 2, 3, 3, 1, а второй - числа 6, 8, 11, 10, 7. Будем считать, что каждый столбец - это признак, а строка - наблюдение. Затем найдите среднее значение по каждому признаку, используя метод mean массива Numpy. Результат запишите в массив mean_a, в нем должно быть 2 элемента.

In [1]:
import numpy as np

In [2]:
a = np.array([[1,6],
              [2,8],
              [3,11],
              [3,10],
              [1,7]])

In [3]:
a.shape

(5, 2)

In [4]:
mean_a = a.mean(axis=0)

In [5]:
print(mean_a)

[2.  8.4]

### Задание 2

Вычислите массив a_centered, отняв от значений массива “а” средние значения соответствующих признаков, содержащиеся в массиве mean_a. Вычисление должно производиться в одно действие. Получившийся массив должен иметь размер 5x2.

In [6]:
a_centered = a - mean_a

In [7]:
print(a_centered)

[[-1.  -2.4]
 [ 0.  -0.4]
 [ 1.   2.6]
 [ 1.   1.6]
 [-1.  -1.4]]

In [8]:
a_centered.shape

(5, 2)

### Задание 3

Найдите скалярное произведение столбцов массива a_centered. В результате должна получиться величина a_centered_sp. Затем поделите a_centered_sp на N-1, где N - число наблюдений.

In [9]:
a_centered_sp = np.dot(a_centered[:,0],a_centered[:,1])

In [10]:
N = a.shape[0]

In [11]:
a_centered_sp / (N-1)

2.0

### Задание 4

В этом задании проверьте получившееся число, вычислив ковариацию еще одним способом - с помощью функции np.cov. В качестве аргумента m функция np.cov должна принимать транспонированный массив “a”. В получившейся ковариационной матрице (массив Numpy размером 2x2) искомое значение ковариации будет равно элементу в строке с индексом 0 и столбце с индексом 1.

In [12]:
a_cov = np.cov(a.T)

In [13]:
a_cov

array([[1. , 2. ],
       [2. , 4.3]])

## Pandas

### Задание 1

Импортируйте библиотеку Pandas и дайте ей псевдоним pd. Создайте датафрейм authors со столбцами author_id и author_name, в которых соответственно содержатся данные: [1, 2, 3] и ['Тургенев', 'Чехов', 'Островский'].
Затем создайте датафрейм book cо столбцами author_id, book_title и price, в которых соответственно содержатся данные:  
[1, 1, 1, 2, 2, 3, 3],
['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
[450, 300, 350, 500, 450, 370, 290]

In [14]:
import pandas as pd

In [15]:
a = {'author_id': [1, 2, 3],
           'author_name': ['Тургенев', 'Чехов', 'Островский']}

In [16]:
authors = pd.DataFrame(a)

In [17]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [18]:
b = {'author_id': [1, 1, 1, 2, 2, 3, 3],
     'book_title': ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
     'price': [450, 300, 350, 500, 450, 370, 290]}

In [19]:
book = pd.DataFrame(b)

In [20]:
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

### Задание 2

Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id

In [21]:
author_price = pd.merge(authors, book, on='author_id', how='outer')

In [22]:
author_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

### Задание 3

Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими книгами.

In [23]:
author_price.sort_values(by="price", ascending = False, inplace=True)

In [24]:
author_price.reset_index(drop=True, inplace=True)

In [25]:
author_price

   author_id author_name            book_title  price
0          2       Чехов      Толстый и тонкий    500
1          1    Тургенев           Отцы и дети    450
2          2       Чехов       Дама с собачкой    450
3          3  Островский                 Гроза    370
4          1    Тургенев     Дворянское гнездо    350
5          1    Тургенев                 Рудин    300
6          3  Островский  Таланты и поклонники    290

In [26]:
top5 = author_price.head(5)

In [27]:
top5

   author_id author_name         book_title  price
0          2       Чехов   Толстый и тонкий    500
1          1    Тургенев        Отцы и дети    450
2          2       Чехов    Дама с собачкой    450
3          3  Островский              Гроза    370
4          1    Тургенев  Дворянское гнездо    350

### Задание 4

Создайте датафрейм authors_stat на основе информации из authors_price. В датафрейме authors_stat должны быть четыре столбца:
author_name, min_price, max_price и mean_price,
в которых должны содержаться соответственно имя автора, минимальная, максимальная и средняя цена на книги этого автора.

In [28]:
authors_stat = author_price.groupby("author_name").agg(
    max_price=pd.NamedAgg(column='price', aggfunc=max),
    min_price=pd.NamedAgg(column='price', aggfunc=min),
    mean_price=pd.NamedAgg(column='price', aggfunc='mean')   
)

In [29]:
authors_stat

             max_price  min_price  mean_price
author_name
Островский         370        290  330.000000
Тургенев           450        300  366.666667
Чехов              500        450  475.000000

### Задание 5

In [30]:
import numpy as np

In [31]:
author_price = pd.concat([author_price, 
                          pd.DataFrame({'cover': ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']})], axis = 1)

In [32]:
author_price

   author_id author_name            book_title  price    cover
0          2       Чехов      Толстый и тонкий    500  твердая
1          1    Тургенев           Отцы и дети    450   мягкая
2          2       Чехов       Дама с собачкой    450   мягкая
3          3  Островский                 Гроза    370  твердая
4          1    Тургенев     Дворянское гнездо    350  твердая
5          1    Тургенев                 Рудин    300   мягкая
6          3  Островский  Таланты и поклонники    290   мягкая

In [33]:
book_info = pd.pivot_table(author_price, 
                           values = 'price', 
                           index=['author_name'], 
                           columns=['cover'], 
                           aggfunc=np.sum, 
                           fill_value = 0)

In [34]:
book_info

cover        мягкая  твердая
author_name
Островский      290      370
Тургенев        750      350
Чехов           450      500

In [35]:
book_info.to_pickle("C:/Users/Vladislav Divak/Desktop/GeekBrains/python_DS/book_info.pkl")

In [36]:
book_info2 = pd.read_pickle("C:/Users/Vladislav Divak/Desktop/GeekBrains/python_DS/book_info.pkl")

In [37]:
book_info2

cover        мягкая  твердая
author_name
Островский      290      370
Тургенев        750      350
Чехов           450      500